import json, urllib.request
import psycopg2

# ***** connect to the db *******
try:
    conn = psycopg2.connect(database='prisoners', user='postgres', password='Pnemesis353', host='localhost', port='5432')
    print('connected!')
except:
    print("not connected!")
    
cur = conn.cursor()

# -------------------------------------------------------- Military Bases --------------------------------------------------------
url = "https://rwc.shtab.net/api/kublo/?all=1&format=json&latitude=52.10650519075632&limit=1144&longitude=49.74609375000001&page=3&radius=2274"
response = urllib.request.urlopen(url)
data = json.loads(response.read())


for base in data['results']:
    cur.execute("INSERT INTO militarybase (name, longitude, latitude, take_part) VALUES (%s, %s, %s, %s);", 
                (base['name'], 
                 base['longitude'], 
                 base['latitude'], 
                 base['take_part']))
# \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ ////////////////////////////////////////////////////////////////

# ------------------------------------------------------- Statuses creating -------------------------------------------------------
statuses = ['причастен к войне с Украиной',
            'мёртв', 
            'в плену',
            'журналистское расследование']
for s in statuses:
    cur.execute("INSERT INTO status (name) VALUES (%s);", (s,))
# \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ ////////////////////////////////////////////////////////////////

# -------------------------------------------------------- Info's creating --------------------------------------------------------
infos = ['Главное управление разведки Украины',
         'YouTube и другие источники',
         'Журналистские расследования']

for i in infos:
    cur.execute("INSERT INTO info (name) VALUES (%s);", (i,))
# \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ ////////////////////////////////////////////////////////////////

# ----------------------------------------------------- Most valuable changes -----------------------------------------------------

# \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ ////////////////////////////////////////////////////////////////

# ----------------------------------------------------- Soldier count in base -----------------------------------------------------
# cur.execute()
# \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\ ////////////////////////////////////////////////////////////////
conn.commit()

cur.close()
conn.close()

